import math
import sys
sys.path.insert(0, "D:/Qomo/QomoTech/QomoTech_BackEnd")
from core.calc_rotation import 计算点绕坐标轴旋转

直径 = 50
角度 = 45
高度 = 10
分割数 =4
半径 = 直径/2
距离旋转中心的距离 =  100
圆心到等分直线的垂直距离 = 半径 * math.cos(math.pi / 分割数) if 分割数 > 0 else 0.0
弦长 = 2 * 半径 * math.sin(math.pi / 分割数) if 分割数 > 0 else 0.0
print(f"这是详细数据：直径：{直径}，角度：{角度}，高度（无关紧要）：{高度}，分割数：{分割数}，半径：{半径}，距离旋转中心的距离：{距离旋转中心的距离}")
print(f"弦长: {弦长}")
print(f"圆心到等分直线的垂直距离: {圆心到等分直线的垂直距离}")
print("=====================这是骆加思计算出来的点位==================")
弦长中点的位置 = {"x": 圆心到等分直线的垂直距离, "y": 0, "z": 距离旋转中心的距离}
旋转之后的结果 = 计算点绕坐标轴旋转(弦长中点的位置, 角度,"y")
print(f"直接用：计算点绕坐标轴旋转(({圆心到等分直线的垂直距离},{0},{距离旋转中心的距离}), {角度},\"y\")：旋转之后的结果{旋转之后的结果}")
print("=====================这是唐璜臻计算出来的点位==================")
print("旋转中心的点位(0,0,0)")
这是圆心的位置X = math.sin(math.radians(角度))*距离旋转中心的距离
这是圆心的位置Y = 0
这是圆心的位置Z = math.cos(math.radians(角度))*距离旋转中心的距离
print(f"这是圆心旋转后的位置X: {这是圆心的位置X}：计算公式 = 距离旋转中心的高度 * sin(角度) 即：{距离旋转中心的距离} * sin({角度}°)")
print(f"这是圆心旋转后的位置Y: {这是圆心的位置Y}")
print(f"这是圆心旋转后的位置Z: {这是圆心的位置Z}")
圆心到等分直线的X的距离 = 圆心到等分直线的垂直距离 * math.sin(math.radians(角度))
圆心到等分直线的Z的距离 =  圆心到等分直线的垂直距离 * math.cos(math.radians(角度))
print(f"这是等分直线中点的X坐标: 这是圆心旋转后的位置X + 圆心到等分直线的X的距离。即 {这是圆心的位置X} + {圆心到等分直线的X的距离} = {这是圆心的位置X + 圆心到等分直线的X的距离}")
print(f"这是等分直线中点的Z坐标: 这是圆心旋转后的位置Z + 圆心到等分直线的Z的距离。即 {这是圆心的位置Z} - {圆心到等分直线的Z的距离} = {这是圆心的位置Z - 圆心到等分直线的Z的距离}")

print("|------------○")
print("|             \\")
print("|               \\")
print("|                 \\")
print("|                   \\")
print("|---------------------\\")
print("|")
print("|")
print("|")
print("|")
print("|")
print("|")
print("|")
print("|")
print("|")

