执行任务的参数 [
    {'序号': 1, '名称': '右短边', '法线角度': 0.0, '相对旋转角度': 45.0, '中心到边的距离': 2.0, '切角方位角': 0.0, '边长': 2.16, 
    '切割中点的坐标': {'X': 114.93079580767204, 'Y': -138.31700134277344, 'Z': -35.69283253777729}, '从旋转圆心下降的距离': 19.1928, '最长的那条边的切割长度': 3.5861},
    {'序号': 2, '名称': '右上切角', '法线角度': 45.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 35.7792, '边长': 0.594,
    '切割中点的坐标': {'X': 115.05658250203845, 'Y': -137.9634488311369, 'Z': -35.8186192321437}, '从旋转圆心下降的距离': 19.3186, '最长的那条边的切割长度': 1.7069},
    {'序号': 3, '名称': '上长边', '法线角度': 90.0, '相对旋转角度': 45.0, '中心到边的距离': 1.5, '切角方位角': 90.0, '边长': 3.16, 
    '切割中点的坐标': {'X': 114.57724241707876, 'Y': -138.31700134277344, 'Z': -35.339279147184016}, '从旋转圆心下降的距离': 18.8393, '最长的那条边的切割长度': 4.7861}, 
    {'序号': 4, '名称': '左上切角', '法线角度': 135.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 144.2208, '边长': 0.594, 
    '切割中点的坐标': {'X': 115.05658250203845, 'Y': -138.67055385440997, 'Z': -35.8186192321437}, '从旋转圆心下降的距离': 19.3186, '最长的那条边的切割长度': 1.7069},
    {'序号': 5, '名称': '左短边', '法线角度': 180.0, '相对旋转角度': 45.0, '中心到边的距离': 2.0, '切角方位角': 180.0, '边长': 2.16, 
    '切割中点的坐标': {'X': 114.93079580767204, 'Y': -138.31700134277344, 'Z': -35.69283253777729}, '从旋转圆心下降的距离': 19.1928, '最长的那条边的切割长度': 3.5861}, 
    {'序号': 6, '名称': '左下切角', '法线角度': 225.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 215.7792, '边长': 0.594,
    '切割中点的坐标': {'X': 115.05658250203845, 'Y': -137.9634488311369, 'Z': -35.8186192321437}, '从旋转圆心下降的距离': 19.3186, '最长的那条边的切割长度': 1.7069}, 
    {'序号': 7, '名称': '下长边', '法线角度': 270.0, '相对旋转角度': 45.0, '中心到边的距离': 1.5, '切角方位角': 270.0, '边长': 3.16, 
    '切割中点的坐标': {'X': 114.57724241707876, 'Y': -138.31700134277344, 'Z': -35.339279147184016}, '从旋转圆心下降的距离': 18.8393, '最长的那条边的切割长度': 4.7861}, 
    {'序号': 8, '名称': '右下切角', '法线角度': 315.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 324.2208, '边长': 0.594,
    '切割中点的坐标': {'X': 115.05658250203845, 'Y': -138.67055385440997, 'Z': -35.8186192321437}, '从旋转圆心下降的距离': 19.3186, '最长的那条边的切割长度': 1.7069}
    ]
well
执行任务的参数 [
    {'序号': 1, '名称': '右短边', '法线角度': 0.0, '相对旋转角度': 45.0, '中心到边的距离': 2.0, '切角方位角': 0.0, '边长': 2.16, 
    '切割中点的坐标': {'X': 72.97000122070312, 'Y': -138.31700134277344, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 2.592}, 
    {'序号': 2, '名称': '右上切角', '法线角度': 45.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 35.7792, '边长': 0.594, 
    '切割中点的坐标': {'X': 73.14789046984218, 'Y': -137.9634488311369, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 0.7128}, 
    {'序号': 3, '名称': '上长边', '法线角度': 90.0, '相对旋转角度': 45.0, '中心到边的距离': 1.5, '切角方位角': 90.0, '边长': 3.16, 
    '切割中点的坐标': {'X': 72.47000122070312, 'Y': -138.31700134277344, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 3.792}, 
    {'序号': 4, '名称': '左上切角', '法线角度': 135.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 144.2208, '边长': 0.594, 
    '切割中点的坐标': {'X': 73.14789046984218, 'Y': -138.67055385440997, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0,'最长的那条边的切割长度': 0.7128}, 
    {'序号': 5, '名称': '左短边', '法线角度': 180.0, '相对旋转角度': 45.0, '中心到边的距离': 2.0, '切角方位角': 180.0, '边长': 2.16, 
    '切割中点的坐标': {'X': 72.97000122070312, 'Y': -138.31700134277344, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 2.592}, 
    {'序号': 6, '名称': '左下切角', '法线角度': 225.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 215.7792, '边长': 0.594, 
    '切割中点的坐标': {'X': 73.14789046984218, 'Y': -137.9634488311369, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 0.7128}, 
    {'序号': 7, '名称': '下长边', '法线角度': 270.0, '相对旋转角度': 45.0, '中心到边的距离': 1.5, '切角方位角': 270.0, '边长': 3.16, 
    '切割中点的坐标': {'X': 72.47000122070312, 'Y': -138.31700134277344, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 3.792}, 
    {'序号': 8, '名称': '右下切角', '法线角度': 315.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 324.2208, '边长': 0.594, 
    '切割中点的坐标': {'X': 73.14789046984218, 'Y': -138.67055385440997, 'Z': -16.500000839233397}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 0.7128}]
well
执行任务的参数 [{'序号': 1, '名称': '右短边', '法线角度': 0.0, '相对旋转角度': 45.0, '中心到边的距离': 2.0, '切角方位角': 0.0, '边长': 2.16, '切割中点的坐标': {'X': 110.68815512055275, 'Y': -138.31700134277344, 'Z': -31.450191850658005}, '从旋转圆心下降的距离': 14.9502, '最长的那条边的切割长度': 4.5802}, {'序号': 2, '名称': '右上切角', '法线角度': 45.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 35.7792, '边长': 0.594, '切割中点的坐标': {'X': 110.56236842618634, 'Y': -137.9634488311369, 'Z': -31.324405156291593}, '从旋转圆心下降的距离': 14.8244, '最长的那条边的切割长度': 2.701}, {'序号': 3, '名称': '上长边', '法线角度': 90.0, '相对旋转角度': 45.0, '中心到边的距离': 1.5, '切角方位角': 90.0, '边长': 3.16, '切割中点的坐标': {'X': 111.04170851114603, 'Y': -138.31700134277344, 'Z': -31.803745241251274}, '从旋转圆心下降的距离': 15.3037, '最长的那条边的切割长度': 5.7802}, {'序号': 4, '名称': '左上切角', '法线角度': 135.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 144.2208, '边长': 0.594, '切割中点的坐标': {'X': 110.56236842618634, 'Y': -138.67055385440997, 'Z': -31.324405156291593}, '从旋转圆心下降的距离': 14.8244, '最长的那条边的切割长度': 2.701}, {'序号': 5, '名称': '左短边', '法线角度': 180.0, '相对旋转角度': 45.0, '中心到边的距离': 2.0, '切角方位角': 180.0, '边长': 2.16, '切割中点的坐标': {'X': 110.68815512055275, 'Y': -138.31700134277344, 'Z': -31.450191850658005}, '从旋转圆心下降的距离': 14.9502, '最长的那条边的切割长度': 4.5802}, {'序号': 6, '名称': '左下切角', '法线角度': 225.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 215.7792, '边长': 0.594, '切割中点的坐标': {'X': 110.56236842618634, 'Y': -137.9634488311369, 'Z': -31.324405156291593}, '从旋转圆心下降的距离': 14.8244, '最长的那条边的切割长度': 2.701}, {'序号': 7, '名称': '下长边', '法线角度': 270.0, '相对旋转角度': 45.0, '中心到边的距离': 1.5, '切角方位角': 270.0, '边长': 3.16, '切割中点的坐标': {'X': 111.04170851114603, 'Y': -138.31700134277344, 'Z': -31.803745241251274}, '从旋转圆心下降的距离': 15.3037, '最长的那条边的切割长度': 5.7802}, {'序号':8, '名称': '右下切角', '法线角度': 315.0, '相对旋转角度': 45.0, '中心到边的距离': 2.2064, '切角方位角': 324.2208, '边长': 0.594, '切割中点的坐标': {'X': 110.56236842618634, 'Y': -138.67055385440997, 'Z': -31.324405156291593}, '从旋转圆心下降的距离': 14.8244, '最长的那条边的切割长度': 2.701}]
well










执行任务的参数 [
    {'序号': 1, '名称': '右短边', '法线角度': 0.0, '相对旋转角度': 45.0, '中心到边的距离': 4.0, '切角方位角': 0.0, '边长': 4.32, 
    '切割中点的坐标': {'X': 111.81982942239901, 'Y': -108.20700073242188, 'Z': -41.40022421674179}, '从旋转圆心下降的距离': 18.5802, '最长的那条边的切割长度': 5.1484}, 
    {'序号': 2, '名称': '右上切角', '法线角度': 45.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 35.7792, '边长': 1.1879, 
    '切割中点的坐标': {'X': 112.07140281113185, 'Y': -107.49989570914883, 'Z': -41.65179760547463}, '从旋转圆心下降的距离': 18.8318, ' 最长的那条边的切割长度': 2.0163}, 
    {'序号': 3, '名称': '上长边', '法线角度': 90.0, '相对旋转角度': 45.0, '中心到边的距离': 3.0, '切角方位角': 90.0, '边长': 6.32, 
    '切割中点的坐标': {'X': 111.11272264121247, 'Y': -108.20700073242188, 'Z': -40.69311743555525}, '从旋转圆心下降的距离': 17.8731, '最长的那条边的切割长度': 7.1484},
     {'序号': 4, '名称': '左上切角', '法线角度': 135.0, '相对 旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 144.2208, '边长': 1.1879, 
     '切割中点的坐标': {'X': 112.07140281113185, 'Y': -108.91410575569492, 'Z': -41.65179760547463}, '从旋转圆心 下降的距离': 18.8318, '最长的那条边的切割长度': 2.0163}, 
     {'序号': 5, '名称': '左短边', '法线角度': 180.0, '相对旋转角度': 45.0, '中心到边的距离': 4.0, '切角方位角': 180.0, '边长': 4.32, 
     '切割中点的坐标': {'X': 111.81982942239901, 'Y': -108.20700073242188, 'Z': -41.40022421674179}, '从旋转圆心下降的距离': 18.5802, '最长的那条边的切割长度': 5.1484}, 
     {'序号': 6, '名称': '左下切角', '法线角度': 225.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 215.7792, '边长': 1.1879, 
     '切割中点的坐标': {'X': 112.07140281113185, 'Y': -107.49989570914883, 'Z': -41.65179760547463}, '从旋转圆心下降的距离': 18.8318, '最长的那条边的切割长度': 2.0163}, 
     {'序号': 7, '名称': '下长边', '法线角度': 270.0, '相对旋转角度': 45.0, '中心到边的距离': 3.0, '切角方位角': 270.0, '边长': 6.32, 
     '切割中点的坐标': {'X': 111.11272264121247, 'Y': -108.20700073242188, 'Z': -40.69311743555525}, '从旋转圆心下降的距离': 17.8731, '最长的那条边的切割长度': 7.1484}, 
     {'序号': 8, '名称': '右下切角', '法线角度': 315.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 324.2208, '边长': 1.1879, 
     '切割中点的坐标': {'X': 112.07140281113185, 'Y': -108.91410575569492, 'Z': -41.65179760547463}, '从旋转圆心下降的距离': 18.8318, '最长的那条边的切割长度': 2.0163}]
well
执行任务的参数 [
    {'序号': 1, '名称': '右短边', '法线角度': 0.0, '相对旋转角度': 45.0, '中心到边的距离': 4.0, '切角方位角': 0.0, '边长': 4.32, 
    '切割中点的坐标': {'X': 75.13999938964844, 'Y': -108.20700073242188, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 4.32}, 
    {'序号': 2, '名称': '右上切角', '法线角度': 45.0, '相对旋转角度': 45.0, '中心到边的 距离': 4.4128, '切角方位角': 35.7792, '边长': 1.1879, 
    '切割中点的坐标': {'X': 75.49577788792656, 'Y': -107.49989570914883, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 1.1879}, 
    {'序号': 3, '名称': '上长边', '法线角度': 90.0, '相对旋转角度': 45.0, '中心到边的距离': 3.0, '切角方位角': 90.0, '边长': 6.32, 
    '切割中点的坐标': {'X': 74.13999938964844, 'Y': -108.20700073242188, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 6.32}, 
    {'序号': 4, '名称': '左上切角', '法线角度': 135.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 144.2208, '边长': 1.1879, 
    '切割中点的坐标': {'X': 75.49577788792656, 'Y': -108.91410575569492, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最 长的那条边的切割长度': 1.1879}, 
    {'序号': 5, '名称': '左短边', '法线角度': 180.0, '相对旋转角度': 45.0, '中心到边的距离': 4.0, '切角方位角': 180.0, '边长': 4.32, 
    '切割中点的坐标': {'X': 75.13999938964844, 'Y': -108.20700073242188, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 4.32}, 
    {'序号': 6, '名称': '左下切角', '法线角度': 225.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 215.7792, '边长': 1.1879, 
    '切割中点的坐标': {'X': 75.49577788792656, 'Y': -107.49989570914883, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 1.1879}, 
    {'序号': 7, '名称': '下长边', '法线角度': 270.0, '相对旋转角度': 45.0, '中心到边的距离': 3.0, '切角方位角': 270.0, '边长': 6.32, 
    '切割中点的坐标': {'X': 74.13999938964844, 'Y': -108.20700073242188, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 6.32}, 
    {'序号': 8, '名称': '右下切角', '法线角度': 315.0, ' 相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 324.2208, '边长': 1.1879, 
    '切割中点的坐标': {'X': 75.49577788792656, 'Y': -108.91410575569492, 'Z': -22.81999969482422}, '从旋转圆心下降的距离': 0.0, '最长的那条边的切割长度': 1.1879}]
well
执行任务的参数 [{'序号': 1, '名称': '右短边', '法线角度': 0.0, '相对旋转角度': 45.0, '中心到边的距离': 4.0, '切角方位角': 0.0, '边长': 4.32, '切割中点的坐标': {'X': 104.74876161053355, 'Y': -108.20700073242188, 'Z': -34.32915640487632}, '从旋转圆心下降的距离': 11.5092, '最长的那条边的切割长度': 5.9769}, {'序号': 2, '名称': '右上切角', '法线角度': 45.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 35.7792, '边长': 1.1879, '切割中点的坐标': {'X': 104.49718822180071, 'Y': -107.49989570914883, 'Z': -34.0775830161435}, '从旋转圆心下降的距离': 11.2576, '最长的那条边的切割长度': 2.8448}, {'序号': 3, '名称': '上长边', '法线角度': 90.0, '相对旋转角度': 45.0, '中心到边的距离': 3.0, '切角方位角': 90.0, '边长': 6.32, '切割中点的坐标': {'X': 105.45586839172009, 'Y': -108.20700073242188, 'Z': -35.03626318606287}, '从旋转圆心下降的距离': 12.2163, '最长的那条边的切割长度': 7.9769}, {'序号': 4, '名称': '左上切角', '法线角度': 135.0, '相对旋 转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 144.2208, '边长': 1.1879, '切割中点的坐标': {'X': 104.49718822180071, 'Y': -108.91410575569492, 'Z': -34.0775830161435}, '从旋转圆心下降的距离': 11.2576, '最长的那条边的切割长度': 2.8448}, {'序号': 5, '名称': '左短边', '法线角度': 180.0, '相对旋转角度': 45.0, '中心到边的距离': 4.0, '切角方位角': 180.0, '边长': 4.32, '切割中点的坐标': {'X': 104.74876161053355, 'Y': -108.20700073242188, 'Z': -34.32915640487632}, '从旋转圆心下降的距离': 11.5092, '最长的那条边的切割长度': 5.9769}, {'序号': 6, '名称': '左下切角', '法 线角度': 225.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 215.7792, '边长': 1.1879, '切割中点的坐标': {'X': 104.49718822180071, 'Y': -107.49989570914883, 'Z': -34.0775830161435}, '从旋转圆心下降的距离': 11.2576, '最长的那条边的切割长度': 2.8448}, {'序号': 7, '名称': '下长边', '法线角度': 270.0, '相对旋转角度': 45.0, '中心到边的距离': 3.0, '切角方位角': 270.0, '边长': 6.32, '切割中点的坐标': {'X': 105.45586839172009, 'Y': -108.20700073242188, 'Z': -35.03626318606287}, '从旋转圆心下降的距离': 12.2163, '最长的那条边的切割长度': 7.9769}, {'序号': 8, '名称': '右下切角', '法线角度': 315.0, '相对旋转角度': 45.0, '中心到边的距离': 4.4128, '切角方位角': 324.2208, '边长': 1.1879, '切割中点的坐标': {'X': 104.49718822180071, 'Y': -108.91410575569492, 'Z': -34.0775830161435}, '从旋转圆心下降的距离': 11.2576, '最长的那条边的切割长度': 2.8448}]
well
