原始边缘切割速度百分比值=0.5
原始中间切割速度百分比值=1



进度百分比 =35
变化百分比 = 10
当前大区间索引 = int(进度百分比 // 变化百分比) if 变化百分比 > 0 else 0
print(当前大区间索引,"当前大区间索引")
# =====================================
中间切割速度的变化K = 2
中间切割速度的变化B = 50
print(当前大区间索引 % (中间切割速度的变化K + 1),"变化倍数")
当前中间速度百分比值 = min(2.0,max(0.3,round((原始中间切割速度百分比值 + 中间切割速度的变化B/100 * (当前大区间索引 % (中间切割速度的变化K + 1))),4)))
print(当前中间速度百分比值,"当前中间速度百分比值")
# =====================================
每段子区间速度数量 = 5
边缘切割速度的变化K = -1
边缘切割速度的变化B = 5
段内进度 = (进度百分比 % 变化百分比)//(变化百分比//每段子区间速度数量) if 变化百分比 > 0 else 0
print(段内进度,"段内进度")
当前边缘速度百分比值 = min(1.0,max(0.3,round((原始边缘切割速度百分比值 + 边缘切割速度的变化B/100 * 段内进度 + 边缘切割速度的变化K/100 * 当前大区间索引),4)))
print(当前边缘速度百分比值,"当前边缘速度百分比值")





